Repository: GNOME/gnome-video-arcade
Catalog: help/*/*.po
Languages: pl

# _
source: translator-credits
pl: Piotr Drąg <piotrdrag@gmail.com>, 2018 Aviary.pl <community-poland@mozilla.org>, 2018

source: <application>GNOME Video Arcade</application> Manual
pl: Podręcznik <application>Salonu gier GNOME</application>

source: GNOME Video Arcade is a front-end for the <application>Multiple Arcade Machine Emulator (MAME)</application>.
pl: Salon gier GNOME to interfejs dla emulatora <application>MAME</application>.

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License (GFDL), Version 1.1 or any later version published by the Free Software Foundation with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. You can find a copy of the GFDL at this <ulink type="help" url="help:fdl">link</ulink> or in the file COPYING-DOCS distributed with this manual.
pl: Udziela się zezwolenia na kopiowanie, rozpowszechnianie i/lub modyfikację tego dokumentu zgodnie z zasadami Licencji GNU Wolnej Dokumentacji w wersji 1.1 lub dowolnej późniejszej opublikowanej przez Free Software Foundation; bez Sekcji Niezmiennych, bez Tekstu na Przedniej Okładce i bez Tekstu na Tylnej Okładce. Egzemplarz licencji dostępny jest pod tym <ulink type="help" url="help:fdl">odnośnikiem</ulink> oraz w pliku COPYING-DOCS rozprowadzanym z niniejszym podręcznikiem.

source: This manual is part of a collection of GNOME manuals distributed under the GFDL. If you want to distribute this manual separately from the collection, you can do so by adding a copy of the license to the manual, as described in section 6 of the license.
pl: Ten podręcznik jest częścią kolekcji podręczników użytkownika GNOME rozprowadzanych na zasadach GFDL. Jeśli chcesz rozpowszechniać ten podręcznik w odłączeniu od kolekcji, możesz to zrobić dodając kopię licencji do podręcznika, jak wyjaśniono to w sekcji 6. licencji.

source: Many of the names used by companies to distinguish their products and services are claimed as trademarks. Where those names appear in any GNOME documentation, and the members of the GNOME Documentation Project are made aware of those trademarks, then the names are in capital letters or initial capital letters.
pl: Nazwy używane przez firmy, by wyróżniać swoje produkty i usługi są zazwyczaj zarejestrowanymi znakami towarowymi. Jeśli występują one w dokumentacji GNOME, w przypadku gdy są znane przez członków Projektu Dokumentacji GNOME, są one napisane wielkimi literami lub zaczynają się od wielkiej litery.

source: <revnumber>GNOME Video Arcade Manual 1.1</revnumber> <date>2008-02-24</date>
pl: <revnumber>Podręcznik Salonu gier GNOME 1.1</revnumber> <date>2008-02-24</date>

source: This manual describes version 0.5.6 of GNOME Video Arcade
pl: Ten podręcznik opisuje wersję 0.5.6 Salonu gier GNOME

source: Introduction
pl: Wprowadzenie

source: The <application>GNOME Video Arcade</application> application allows you to play classic coin-operated arcade games on your GNOME desktop using the <application>Multiple Arcade Machine Emulator (MAME)</application>.
pl: <application>Salon gier GNOME</application> umożliwia grę na klasycznych automatach do gier w środowisku GNOME za pomocą emulatora <application>MAME</application>.

source: <application>GNOME Video Arcade</application> provides the following features:
pl: <application>Salon gier GNOME</application> ma następujące funkcje:

source: Play classic arcade games on your desktop.
pl: Gra na klasycznych automatach do gier.

source: Tag favorite games to easily find them again later.
pl: Oznaczanie ulubionych gier, aby łatwiej je później znaleźć.

source: Read historical information and tips about your favorite games.
pl: Czytanie informacji historycznych i wskazówek na temat ulubionych gier.

source: Game recording and play back.
pl: Nagrywanie i odtwarzanie gier.

source: Search.
pl: Wyszukiwanie.

source: Getting Started
pl: Pierwsze kroki

source: Starting GNOME Video Arcade
pl: Uruchamianie Salonu gier GNOME

source: You can start <application>GNOME Video Arcade</application> in the following ways:
pl: Można uruchomić <application>Salon gier GNOME</application> na te sposoby:

source: <guimenu>Applications</guimenu> menu
pl: Menu <guimenu>Programy</guimenu>

source: Choose <menuchoice> <guisubmenu>Games</guisubmenu> <guimenuitem>Video Arcade</guimenuitem> </menuchoice>.
pl: Wybierz <menuchoice> <guisubmenu>Gry</guisubmenu> <guimenuitem>Salon gier</guimenuitem> </menuchoice>.

source: Command line
pl: Wiersz poleceń

source: To start <application>GNOME Video Arcade</application> from a command line, type the following command, then press <keycap>Return</keycap>:
pl: Aby uruchomić <application>Salon gier GNOME</application> z wiersza poleceń, wpisz poniższe polecenie, a następnie naciśnij klawisz <keycap>Enter</keycap>:

source: To view other command line options that are available, type <command>gnome-video-arcade --help</command>, then press <keycap>Return</keycap>.
pl: Aby wyświetlić inne dostępne opcje wiersza poleceń, wpisz <command>gnome-video-arcade --help</command>, a następnie naciśnij klawisz <keycap>Enter</keycap>.

source: When You Start GNOME Video Arcade
pl: Po uruchomieniu Salonu gier GNOME

source: The first time <application>GNOME Video Arcade</application> starts, it will build a database of game information and analyze available ROM files to determine which games are playable. This process may take several minutes to complete, during which time the following window is displayed:
pl: Po pierwszym uruchomieniu <application>Salonu gier GNOME</application> zbuduje on bazę danych informacji o grach i przeanalizuje dostępne pliki ROM, aby ustalić, w które gry można grać. Ukończenie tego procesu może zająć kilka minut, a w jego trakcie wyświetlane jest to okno:

source: GNOME Video Arcade Building the Game Database
pl: Salon gier GNOME buduje bazę danych gier

source: Shows GNOME Video Arcade main window while the database is being built. Most of the elements are grayed out, and a progress bar is shown at the bottom.
pl: Wyświetla główne okno Salonu gier GNOME podczas budowania bazy danych. Większość elementów jest wyszarzona, a na dole wyświetlany jest pasek postępu.

source: The window will then change to look like this:
pl: Następnie okno zmieni wygląd na taki:

source: GNOME Video Arcade Start Up Window
pl: Okno startowe Salonu gier GNOME

source: Shows GNOME Video Arcade main window with a sample list of games. Contains menubar, game list, view buttons, start game button, properties button and statusbar.
pl: Wyświetla główne okno Salonu gier GNOME z prostą listą gier. Zawiera pasek menu, listę gier, przyciski widoku, przycisk uruchamiania gry, przycisk właściwości i pasek stanu.

source: You may see a different list of games, depending on which ROM images are installed on your system.
pl: Lista gier zależy od obrazów ROM zainstalowanych na komputerze.

source: If you know that ROM images are installed on your system but <application>GNOME Video Arcade</application> does not list any games, it may be that <application>MAME</application> is misconfigured or none of the installed ROM images are playable. See the Troubleshooting section for more information.
pl: Jeśli obrazy ROM są zainstalowane na komputerze, ale <application>Salon gier GNOME</application> nie wyświetla żadnych, to być może emulator <application>MAME</application> jest błędnie skonfigurowany lub nie można grać w żadne zainstalowane obrazy ROM. Sekcja rozwiązywania błędów zawiera więcej informacji.

source: Occasionally, the database may be rebuilt when <application>GNOME Video Arcade</application> starts. Most of the time it will skip this process and go straight to the window in Figure 2.
pl: Czasami baza danych może zostać przebudowana podczas uruchamiania <application>Salonu gier GNOME</application>. Zazwyczaj jednak ten proces jest pomijany i od razu zostanie wyświetlone okno z 2. ilustracji.

source: The <application>GNOME Video Arcade</application> window contains the following elements:
pl: Okno <application>Salonu gier GNOME</application> zawiera te elementy:

source: Menubar
pl: Pasek menu

source: The menus on the menubar contain all the commands needed to use <application>GNOME Video Arcade</application>.
pl: Menu na pasku menu zawierają wszystkie polecenia potrzebne do używania <application>Salonu gier GNOME</application>.

source: Game List
pl: Lista gier

source: The game list displays a list of games to choose from.
pl: Lista gier wyświetla listę gier do wyboru.

source: View Buttons
pl: Przyciski widoku

source: The view buttons control which games are displayed in the game list. Choose between displaying all available games, a list of favorite games, or previous search results.
pl: Przyciski widoku kontrolują, które gry są wyświetlane na liście gier. Wybierz między wyświetlaniem wszystkich gier, listy ulubionych gier lub poprzednich wyników wyszukiwania.

source: <guibutton>Start Game</guibutton> Button
pl: Przycisk <guibutton>Rozpocznij grę</guibutton>

source: The <guibutton>Start Game</guibutton> button starts the highlighted game in the game list.
pl: Przycisk <guibutton>Rozpocznij grę</guibutton> uruchamia grę wyróżnioną na liście gier.

source: <guibutton>Properties</guibutton> Button
pl: Przycisk <guibutton>Właściwości</guibutton>

source: The <guibutton>Properties</guibutton> button displays additional information about the highlighted game in the game list.
pl: Przycisk <guibutton>Właściwości</guibutton> wyświetla dodatkowe informacje o wyróżnionej grze na liście gier.

source: Statusbar
pl: Pasek stanu

source: The statusbar displays the <application>MAME</application> version used to play games and contextual information about the menu items. It also displays a progress bar while building the game database.
pl: Pasek stanu wyświetla wersję emulatora <application>MAME</application> używaną do grania i informacje kontekstowe o elementach menu. Wyświetla także pasek postępu podczas budowania bazy danych gier.

source: Usage
pl: Użycie

source: To Start a Game
pl: Uruchamianie gry

source: Choose a game from the game list and click on it to highlight it. Then click the <guibutton>Start Game</guibutton> button or choose <menuchoice> <shortcut> <keycombo> <keycap>Ctrl</keycap> <keycap>S</keycap> </keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Start</guimenuitem> </menuchoice>.
pl: Wybierz grę z listy gier i kliknij ją, aby ją wyróżnić. Następnie kliknij przycisk <guibutton>Rozpocznij grę</guibutton> lub wybierz <menuchoice> <shortcut> <keycombo> <keycap>Ctrl</keycap> <keycap>S</keycap> </keycombo> </shortcut> <guimenu>Gra</guimenu> <guimenuitem>Rozpocznij</guimenuitem> </menuchoice>.

source: You can also start a game by double-clicking on it in the game list.
pl: Można także uruchomić grę klikając ją podwójnie na liście gier.

source: To View Properties of a Game
pl: Wyświetlanie właściwości gry

source: Choose a game from the game list and click on it to highlight it. Then click the <guibutton>Properties</guibutton> button or choose <menuchoice> <shortcut> <keycombo> <keycap>Ctrl</keycap> <keycap>P</keycap> </keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Properties</guimenuitem> </menuchoice>.
pl: Wybierz grę z listy gier i kliknij ją, aby ją wyróżnić. Następnie kliknij przycisk <guibutton>Właściwości</guibutton> lub wybierz <menuchoice> <shortcut> <keycombo> <keycap>Ctrl</keycap> <keycap>P</keycap> </keycombo> </shortcut> <guimenu>Widok</guimenu> <guimenuitem>Właściwości</guimenuitem> </menuchoice>.

source: The <guilabel>Properties</guilabel> dialog displays information about the highlighted game, including some history about the game, tips and tricks to help improve your scores, pictures of the arcade cabinet, screen shots of the game in progress and some technical information about <application>MAME</application>'s emulation of the game.
pl: Okno <guilabel>Właściwości</guilabel> wyświetla informacje o wyróżnionej grze, w tym jej historię, wskazówki i podpowiedzi, jak zwiększyć swoje wyniki, zdjęcia automatu do gry, zrzuty ekranu rozgrywanej gry i pewne informacje techniczne o emulacji gry przez <application>MAME</application>.

source: To close the <guilabel>Properties</guilabel> dialog, click the <guibutton>Close</guibutton> button.
pl: Aby zamknąć okno <guilabel>Właściwości</guilabel>, kliknij przycisk <guibutton>Zamknij</guibutton>.

source: Some of these features are not yet completed and will be available in a future version of <application>GNOME Video Arcade</application>.
pl: Część tych funkcji nie jest jeszcze kompletna i będzie dostępna w przyszłej wersji <application>Salonu gier GNOME</application>.

source: To Tag a Game as a Favorite
pl: Oznaczanie gry jako ulubionej

source: To tag a game as a favorite, choose a game from the game list and click on it to highlight it. Then choose <menuchoice> <shortcut> <keycombo> <keycap>Ctrl</keycap> <keycap>+</keycap> </keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Add to Favorites</guimenuitem> </menuchoice>. The heart icon for the highlighted game will light up to indicate that the game has been added to your list of favorites.
pl: Aby oznaczyć grę jako ulubioną, wybierz ją z listy gier i kliknij, aby wyróżnić. Następnie wybierz <menuchoice> <shortcut> <keycombo> <keycap>Ctrl</keycap> <keycap>+</keycap> </keycombo> </shortcut> <guimenu>Gra</guimenu> <guimenuitem>Dodaj do ulubionych</guimenuitem> </menuchoice>. Ikona serca dla wyróżnionej gry zostanie zapalona, co wskazuje, że gra została dodana do listy ulubionych.

source: If a game is no longer your favorite, click on its name in the game list to highlight it. Then choose <menuchoice> <shortcut> <keycombo> <keycap>Ctrl</keycap> <keycap>-</keycap> </keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Remove from Favorites</guimenuitem> </menuchoice>. The heart icon for the highlighted game will turn gray to indicate that the game has been removed from your list of favorites.
pl: Jeśli jakaś gra nie jest już ulubiona, to kliknij jej nazwę na liście gier, aby ją wyróżnić. Następnie wybierz <menuchoice> <shortcut> <keycombo> <keycap>Ctrl</keycap> <keycap>-</keycap> </keycombo> </shortcut> <guimenu>Gra</guimenu> <guimenuitem>Usuń z ulubionych</guimenuitem> </menuchoice>. Ikona serca dla wyróżnionej gry zostanie wyszarzona, co wskazuje, że gra została usunięta z listy ulubionych.

source: You can also click directly on a heart icon in the game list to tag the game as a favorite or not a favorite.
pl: Można także bezpośrednio kliknąć ikonę serca na liście gier, aby oznaczyć grę jako ulubioną lub nieulubioną.

source: To Change Which Games Are Displayed
pl: Zmiana, które gry są wyświetlane

source: To show all available games in the game list, click the <guibutton>Available Games</guibutton> view button or choose <menuchoice> <guimenu>View</guimenu> <guimenuitem>Available Games</guimenuitem> </menuchoice>.
pl: Aby wyświetlać wszystkie dostępne gry na liście gier, kliknij przycisk widoku <guibutton>Dostępne gry</guibutton> lub wybierz <menuchoice> <guimenu>Widok</guimenu> <guimenuitem>Dostępne gry</guimenuitem> </menuchoice>.

source: To show only your favorite games in the game list, click the <guibutton>Favorite Games</guibutton> view button or choose <menuchoice> <guimenu>View</guimenu> <guimenuitem>Favorite Games</guimenuitem> </menuchoice>.
pl: Aby wyświetlać tylko ulubione gry na liście gier, kliknij przycisk widoku <guibutton>Ulubione gry</guibutton> lub wybierz <menuchoice> <guimenu>Widok</guimenu> <guimenuitem>Ulubione gry</guimenuitem> </menuchoice>.

source: To show your previous search results in the game list, click the <guibutton>Search Results</guibutton> view button or choose <menuchoice> <guimenu>View</guimenu> <guimenuitem>Search Results</guimenuitem> </menuchoice>.
pl: Aby wyświetlać poprzednie wyniki wyszukiwania na liście gier, kliknij przycisk widoku <guibutton>Wyniki wyszukiwania</guibutton> lub wybierz <menuchoice> <guimenu>Widok</guimenu> <guimenuitem>Wyniki wyszukiwania</guimenuitem> </menuchoice>.

source: To Search for Games
pl: Wyszukiwanie gier

source: Choose <menuchoice> <shortcut> <keycombo> <keycap>Ctrl</keycap> <keycap>F</keycap> </keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Search...</guimenuitem> </menuchoice> to display the following dialog:
pl: Wybierz <menuchoice> <shortcut> <keycombo> <keycap>Ctrl</keycap> <keycap>F</keycap> </keycombo> </shortcut> <guimenu>Edycja</guimenu> <guimenuitem>Znajdź…</guimenuitem> </menuchoice>, aby wyświetlić to okno:

source: GNOME Video Arcade Search Dialog
pl: Okno wyszukiwania Salonu gier GNOME

source: Shows GNOME Video Arcade search dialog. Contains text entry box, find button and close button.
pl: Wyświetla okno wyszukiwania Salonu gier GNOME. Zwiera pole wpisywania tekstu, przycisk wyszukiwania i przycisk zamknięcia.

source: Type your search criteria in the entry box. Search by the title of the game, the company that manufactured the game, the year the game was released, or the name of the game's ROM set or <application>MAME</application> driver.
pl: Wpisz wyszukiwane słowa w polu tekstowym. Szukaj według tytułu gry, jej producenta, roku wydania, nazwy zestawu plików ROM gry lub sterownika emulatora <application>MAME</application>.

source: Click the <guibutton>Find</guibutton> button to start your search. The <guilabel>Search</guilabel> dialog will close and the results of your search will be displayed in the game list.
pl: Kliknij przycisk <guibutton>Znajdź</guibutton>, aby rozpocząć wyszukiwanie. Okno <guilabel>Wyszukiwanie</guilabel> zostanie zamknięte, a wyniki wyszukiwania będą wyświetlane na liście gier.

source: Click the <guibutton>Close</guibutton> button to close the <guilabel>Search</guilabel> dialog without searching.
pl: Kliknij przycisk <guibutton>Zamknij</guibutton>, aby zamknąć okno <guilabel>Wyszukiwanie</guilabel> bez wyszukiwania.

source: To Record a Game
pl: Nagrywanie gry

source: Choose a game from the game list and click on it to highlight it. Then choose <menuchoice> <shortcut> <keycombo> <keycap>Ctrl</keycap> <keycap>R</keycap> </keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Record</guimenuitem> </menuchoice>.
pl: Wybierz grę z listy gier i kliknij ją, aby wyróżnić. Następnie wybierz <menuchoice> <shortcut> <keycombo> <keycap>Ctrl</keycap> <keycap>R</keycap> </keycombo> </shortcut> <guimenu>Gra</guimenu> <guimenuitem>Nagraj</guimenuitem> </menuchoice>.

source: After you exit from <application>MAME</application>, your new recording will be highlighted in the following window:
pl: Po wyjściu z emulatora <application>MAME</application> nowe nagranie będzie wyróżnione w tym oknie:

source: GNOME Video Arcade Recorded Games Window
pl: Okno nagranych gier Salonu gier GNOME

source: Shows GNOME Video Arcade recorded games window. Contains list of game recordings, play back button, delete button and close button.
pl: Wyświetla okno nagranych gier Salonu gier GNOME. Zawiera listę nagrań gier, przycisk odtwarzania, przycisk usuwania i przycisk zamknięcia.

source: Each entry shows the title of the game that was recorded, and the date and time when recording began. Click on the game's title to customize the comment. You can add more information to the comment such as the final score or level reached.
pl: Każdy wpis wyświetla tytuł nagranej gry oraz datę i czas rozpoczęcia nagrania. Kliknij tytuł gry, aby dostosować komentarz. Można dodać więcej informacji do komentarza, np. końcowy wynik lub osiągnięty poziom.

source: To Play Back a Recorded Game
pl: Odtwarzanie nagranej gry

source: Choose <menuchoice> <guimenu>Game</guimenu> <guimenuitem>Play Back...</guimenuitem> </menuchoice> to display the <guilabel>Recorded Games</guilabel> window. Choose a game recording to play back and click on it to highlight it. Then click the <guibutton>Play Back</guibutton> button.
pl: Wybierz <menuchoice> <guimenu>Gra</guimenu> <guimenuitem>Odtwórz…</guimenuitem> </menuchoice>, aby wyświetlić okno <guilabel>Nagrane gry</guilabel>. Wybierz nagranie gry do odtworzenia i kliknij ją, aby wyróżnić. Następnie kliknij przycisk <guibutton>Odtwórz</guibutton>.

source: Preferences
pl: Preferencje

source: To modify the preferences of <application>GNOME Video Arcade</application>, choose <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Preferences</guimenuitem> </menuchoice>.
pl: Aby zmodyfikować preferencje <application>Salonu gier GNOME</application>, wybierz <menuchoice> <guimenu>Edycja</guimenu> <guimenuitem>Preferencje</guimenuitem> </menuchoice>.

source: The <guilabel>Preferences</guilabel> dialog contains the following sections:
pl: Okno <guilabel>Preferencje</guilabel> zawiera te sekcje:

source: General
pl: Ogólne

source: Shows the General tab of the Preferences window.
pl: Wyświetla kartę Ogólne okna Preferencje.

source: <guilabel> Start games in fullscreen mode </guilabel>
pl: <guilabel> Rozpoczynanie gier w trybie pełnoekranowym </guilabel>

source: Select this option to start games in fullscreen mode. Otherwise, games will be started in a window.
pl: Zaznacz tę opcję, aby uruchamiać gry w trybie pełnoekranowym. W przeciwnym wypadku gry będą uruchamiane w oknie.

source: <guilabel> Restore previous state when starting a game </guilabel>
pl: <guilabel> Przywracanie poprzedniego stanu podczas rozpoczynania gry </guilabel>

source: Select this option to continue where you left off when you last exited <application>MAME</application>. If this option is not selected, the emulator will boot the arcade machine each time a game is started.
pl: Zaznacz tę opcję, aby kontynuować w miejscu, w którym opuszczono emulator <application>MAME</application>. Jeśli ta opcja nie jest zaznaczona, to emulator będzie uruchamiał automat do gry od nowa za każdym razem, gdy uruchamiana jest gra.

source: State restoration does not take effect until the second time the game is started with the option enabled. It does not apply to recording or playing back games.
pl: Przywracanie stanu nie będzie działało, dopóki gra nie zostanie uruchomiona drugi raz po włączeniu tej opcji. Nie ma zastosowania do nagrywania ani odtwarzania gier.

source: Not all games support this feature.
pl: Nie wszystkie gry obsługują tę funkcję.

source: <guilabel> Show alternate versions of original games </guilabel>
pl: <guilabel> Wyświetlanie alternatywnych wersji oryginalnych gier </guilabel>

source: Select this option to show alternate versions of original games in the game list in the main window.
pl: Zaznacz tę opcję, aby wyświetlać alternatywne wersje oryginalnych gier na liście gier w głównym oknie.

source: What are alternate versions?
pl: Czym są alternatywne wersje?

source: From the <ulink url="http://mamedev.org/devwiki/index.php/FAQ:General_Games"><application>MAME</application> FAQ</ulink>:
pl: Z <ulink url="http://mamedev.org/devwiki/index.php/FAQ:General_Games">dokumentu FAQ emulatora <application>MAME</application></ulink>:

source: Games were often licensed to other companies for a variety of reasons: the most common was that the makers wished to sell the game in a country or region in which they had no distribution of their own. In the early 80s, Namco had no US distribution network so their games were licensed to Atari, Bally-Midway, and others. Conversely, Atari licensed their games to Japanese companies (usually Namco) for sale there.
pl: Gry były często licencjonowane innym firmom z wielu powodów: najczęściej producenci chcieli sprzedawać grę w kraju lub regionie, w którym nie mieli własnych systemów dystrybucji. We wczesnych latach 80 firma Namco nie miała sieci dystrybucji w Stanach Zjednoczonych, więc jej gry były licencjonowane firmom Atari, Bally-Midway i innym. I odwrotnie, firma Atari licencjonowała swoje gry japońskim firmom (zwykle Namco) w celu lokalnej sprzedaży.
