Repository: GNOME/gnome-video-arcade
Catalog: help/*/*.po
Languages: pl

source: Sometimes a set of ROMs with a different copyright date is found, or a bootleg set, or another alternate version. When the <quote>parent</quote> game has already been emulated in <application>MAME</application>, these alternates are usually easy to add. In some cases, alternate versions are slightly different: Game levels are in a different order, the game is harder or faster, etc.
pl: Czasami odnajdywany jest zestaw ROM-ów z różnymi datami praw autorskich lub zestaw piracki albo inna wersja alternatywna. Kiedy gra <quote>nadrzędna</quote> była już emulowana w emulatorze <application>MAME</application>, te alternatywne wersje można zwykle łatwo dodać. W niektórych przypadkach alternatywne wersje nieznacznie się różnią: poziomy gry są w innej kolejności, gra jest trudniejsza lub szybsza itp.

source: In some cases, ROMs were hacked to run on hardware they were not intended for. For example, when <productname>Pac-Man</productname> was <quote>hot,</quote> some arcade operators found a way to dump <productname>Pac-Man</productname> ROMs and hack them to work on <productname>Scramble</productname> machines so they wouldn't have to purchase extra <productname>Pac-Man</productname> boards. Since these hacked versions are masterpieces in their own right, the <application>MAME</application> developers have included them.
pl: W niektórych przypadkach ROM-y były zmieniane, aby działały na innym sprzęcie, niż im przeznaczony. Na przykład, kiedy <productname>Pac-Man</productname> był <quote>superpopularny</quote>, niektórzy właściciele salonów gier znaleźli sposób na zrzucenie ROM-ów <productname>Pac-Mana</productname> i zmianę ich tak, aby działały na automatach <productname>Scramble</productname>, dzięki czemu nie musieli kupować dodatkowych płyt głównych <productname>Pac-Mana</productname>. Jako że te zmienione wersje są arcydziełami samymi w sobie, programiści emulatora <application>MAME</application> je dołączyli.

source: Columns
pl: Kolumny

source: Shows the Columns tab of the Preferences window.
pl: Wyświetla kartę Kolumny okna Preferencje.

source: The <guilabel>Columns</guilabel> tab allows you to configure the game list in the main window to show additional information about the available games. The column names are listed in the order that they appear in the game list. Reorder columns and show additional columns using the <guibutton>Move Up</guibutton>, <guibutton>Move Down</guibutton>, <guibutton>Show</guibutton> and <guibutton>Hide</guibutton> buttons to the right of the column list.
pl: Karta <guilabel>Kolumny</guilabel> umożliwia skonfigurowanie listy gier w głównym oknie tak, aby wyświetlała dodatkowe informacje o dostępnych grach. Nazwy kolumn są wyświetlane w kolejności, w jakiej będą na liście gier. Zmień kolejność kolumn i wyświetl dodatkowe kolumny za pomocą przycisków <guibutton>W górę</guibutton>, <guibutton>W dół</guibutton>, <guibutton>Wyświetl</guibutton> i <guibutton>Ukryj</guibutton> na prawo od listy kolumn.

source: Troubleshooting
pl: Rozwiązywanie problemów

source: No games listed in the main window
pl: Na liście w głównym oknie nie ma gier

source: Are any ROM images installed?
pl: Czy jakieś obrazy ROM są zainstalowane?

source: For legal reasons, games are not bundled with <application>GNOME Video Arcade</application> or <application>MAME</application>. The <ulink url="http://mamedev.org/devwiki/index.php/FAQ:Setting_Up"><application>MAME</application> FAQ</ulink> has some suggestions for obtaining ROM images:
pl: Z przyczyn prawnych <application>Salon gier GNOME</application> i emulator <application>MAME</application> nie zawierają żadnych gier. <ulink url="http://mamedev.org/devwiki/index.php/FAQ:Setting_Up">Dokument FAQ emulatora <application>MAME</application></ulink> ma kilka wskazówek, skąd wziąć obrazy ROM:

source: There are several means of obtaining ROM images for use in <application>MAME</application>:
pl: Dostępnych jest kilka sposobów uzyskiwania obrazów ROM do użycia w emulatorze <application>MAME</application>:

source: A small number of ROM images are now available with the copyright holders' permission at the <ulink url="http://mamedev.org/roms/">mamedev.org ROMs page</ulink>.
pl: Mała liczba obrazów ROM jest teraz dostępna za pozwoleniem właściciela praw autorskich na <ulink url="http://mamedev.org/roms/">stronie ROM-ów mamedev.org</ulink>.

source: The <ulink url="http://www.hanaho.com/Products/HotRodJoystick.php"><productname>HotRod Joystick</productname> control panel</ulink> from <ulink url="http://www.hanaho.com/">Hanaho Games, Inc.</ulink> comes bundled with a CD that includes <application>MAME</application> and a selection of Capcom ROMs. Hanaho also sells the <ulink url="http://www.hanaho.com/Products/ArcadePC.php"><productname>ArcadePC</productname> cabinet</ulink> with a different selection of Capcom ROMs.
pl: <ulink url="http://www.hanaho.com/Products/HotRodJoystick.php">Panel sterowania <productname>HotRod Joystick</productname></ulink> od firmy <ulink url="http://www.hanaho.com/">Hanaho Games, Inc.</ulink> zawiera płytę CD z emulatorem <application>MAME</application> i zbiorem ROM-ów firmy Capcom. Hanaho sprzedaje także <ulink url="http://www.hanaho.com/Products/ArcadePC.php">automat <productname>ArcadePC</productname></ulink> z innym zbiorem ROM-ów firmy Capcom.

source: You can purchase your own arcade PCBs (on <ulink url="http://www.ebay.com/">eBay</ulink>, for example), buy a ROM reader, and use it to copy the ROM chips' contents into files for your personal use.
pl: Można kupić własne płyty główne automatów (np. w serwisie <ulink url="http://www.ebay.com/">eBay</ulink>), kupić czytnik ROM-ów i użyć go do skopiowania zawartości układów ROM do plików na użytek osobisty.

source: Always check if the particular arcade games' copyright owner is selling the ROMs legally (as with Capcom). That way you will support the companies that support emulation.
pl: Zawsze sprawdzaj, czy dany właściciel praw autorskich gier na automaty sprzedaje ROM-y legalnie (tak jak Capcom). W ten sposób wspierasz firmy wspierające legalną emulację.

source: Can <application>MAME</application> find the installed ROM images?
pl: Czy emulator <application>MAME</application> może odnaleźć zainstalowane obrazy ROM?

source: <application>GNOME Video Arcade</application> relies on <application>MAME</application> to find installed ROM images. To test where <application>MAME</application> is configured to look for ROM images, type the following command on a command line, then press <keycap>Return</keycap>:
pl: <application>Salon gier GNOME</application> używa emulatora <application>MAME</application> do odnajdywania zainstalowanych obrazów ROM. Aby przetestować, gdzie emulator <application>MAME</application> jest skonfigurowany do wyszukiwania obrazów ROM, wpisz to polecenie w wierszu poleceń, a następnie naciśnij klawisz <keycap>Enter</keycap>:

source: <command>gnome-video-arcade --inspect rompath</command>
pl: <command>gnome-video-arcade --inspect ścieżka-do-pliku-rom</command>

source: The command should print a directory name such as <computeroutput>/usr/share/mame/roms</computeroutput>. Move ROM images to this directory and restart <application>GNOME Video Arcade</application>.
pl: Polecenie powinno wyświetlić nazwę katalogu, taką jak <computeroutput>/usr/share/mame/roms</computeroutput>. Przenieś obrazy ROM do tego katalogu i ponownie uruchom <application>Salon gier GNOME</application>.

source: If the command does not print a directory name, it may mean that <application>MAME</application> is not properly configured on your system. If you obtained <application>MAME</application> from a <productname>GNU/Linux</productname> distribution, please contact the maintainers of that distribution for further instructions.
pl: Jeśli polecenie nie wyświetli nazwy katalogu, to może oznaczać, że emulator <application>MAME</application> nie jest poprawnie skonfigurowany na komputerze. Jeśli emulator <application>MAME</application> został zainstalowany z dystrybucji systemu <productname>GNU/Linux</productname>, to proszę skontaktować się z opiekunami tej dystrybucji, aby uzyskać więcej informacji.

source: Is the Available Games view selected?
pl: Czy wybrany jest widok Dostępne gry?

source: If no games have been tagged as favorites, the <guilabel>Favorite Games</guilabel> view will be empty. Similarly, if no searches have been run, the <guilabel>Search Results</guilabel> view will be empty. Switch to the <guilabel>Available Games</guilabel> view to ensure all available games are listed.
pl: Jeśli żadne gry nie są oznaczone jako ulubione, to widok <guilabel>Ulubione gry</guilabel> będzie pusty. Podobnie, jeśli nic nie wyszukiwano, to widok <guilabel>Wyniki wyszukiwania</guilabel> będzie pusty. Przełącz na widok <guilabel>Dostępne gry</guilabel>, aby upewnić się, że wszystkie dostępne gry są na liście.

source: link
pl: odnośnikiem

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License (GFDL), Version 1.1 or any later version published by the Free Software Foundation with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. You can find a copy of the GFDL at this <_:ulink-1/> or in the file COPYING-DOCS distributed with this manual.
pl: Udziela się zezwolenia na kopiowanie, rozpowszechnianie i/lub modyfikację tego dokumentu zgodnie z zasadami Licencji GNU Wolnej Dokumentacji w wersji 1.1 lub dowolnej późniejszej opublikowanej przez Free Software Foundation; bez Sekcji Niezmiennych, bez Tekstu na Przedniej Okładce i bez Tekstu na Tylnej Okładce. Egzemplarz licencji dostępny jest pod tym <_:ulink-1/> oraz w pliku COPYING-DOCS rozprowadzanym z niniejszym podręcznikiem.
